import Foundation


struct HeatExchangerData: Workable {
    
    let theory = "По ГОСТ 31842-2012, стальные кожухотрубчатые аппараты изготавливают следующих типов: \n– с жестким кожухом и неподвижными трубными решётками «Н»\n– с линзовым компенсатором на кожухе и жестко закреплёнными решетками «К»\n– с жестким кожухом и плавающей головкой «П»\n– с жестким кожухом и с U – образными трубками «У»\n        К/х трубный т/о состоит из цилиндрического сварного кожуха, трубного пучка, двух крышек, распределительной камеры. Трубный пучок образован трубками, закрепленными в двух трубных решетках, которые либо приварены к корпусу, либо одна решетка закрепляется во впадинах фланцев корпуса и распределительной камеры. В трубном пространстве имеются продольные перегородки для многоходового т/о, в межтрубном пространстве поперечные перегородки. Теплообменник снабжен штуцерами для подвода и отвода рабочих сред в межтрубное и трубное пространство. Вертикальный аппарат крепится с помощью боковых лап, горизонтальный аппарат – на седлообразных опорах.\nАппараты с неподвижными трубными решетками.\nТН – применяют при незначительной разности температур 40-60С.\nОсобенностью аппарата типа «Н» является то, что трубы жестко соединены с трубными решетками, а решетки приварены к кожуху.\nЕсли расчетная разность температур кожуха и труб превышает указанную, используют теплообменные аппараты с частичной или полной компенсацией температурных напряжений.\nАппараты с температурным компенсатором на кожухе.\nВ данных аппаратах для компенсации используют специальные гибкие элементы (расширители и компенсаторы), расположенные на кожухе.\nТК- применяют до допускаемой разности температур кожуха и труб, вызывающей разность удлинения + или- 10мм и давлении  2,5 МПа. Одна линза допускает растяжение или сжатие кожуха до 8 мм. Не рекомендуют применять более 4 линз, т.к. резко снижается сопротивление кожуха изгибу.\nТеплообменники с U – образными трубами.\nТУ- делают двух ходовыми по трубному пространству, в этом его конструктивная особенность. При ремонте трубный пучок вместе с решеткой  может быть извлечён из кожуха. Аппараты более 800мм снабжают роликовыми опорами.\nРазность температур не должна превышать 100С.\nТеплообменные аппараты с плавающей головкой.\nТП-  применяют при различном давлении и различной разности температур. При значительных размерах и массе трубчатого пучка его опирают на опорную платформу, которую крепят к продольной балке, приваренной к поперечным перегородкам и неподвижной трубной решётке.\nНаиболее важный узел – соединение плавающей трубной решетки с крышкой, которое должно обеспечить возможность легкого извлечения трубного пучка, а также минимальный зазор между кожухом и пучком труб.      \nОсновные элементы всех кожухотрубчатых теплообменников – кожух (корпус), трубный пучок, состоящий из труб, трубных решеток и  перегородок. \nКожух и распределительные камеры.\nКожух малого диаметра  (менее 600мм) изготавливают из труб, корпус большего диаметра вальцуют из листовой стали.\nДля теплообменных аппратов типов У, П должна быть обеспечена необходимая устойчивость формы кожуха. Для типа Н должна быть обеспечена способность кожуха и труб к самокомпенсации, т.е. способность противостоять напряжениям, возникающим из-за различия их температурных удлинений.\nРаспределительные камеры.\nПредназначены для распределения потока теплоносителя по трубам. Представляют собой обечайку с фланцами, соединенными с трубной решеткой и съёмными эллиптической или плоской крышкой. В некоторых конструкциях крышка приварена к цилиндрической обечайке. \nДля образования ходов теплоносителя по трубам распределительную камеру снабжают продольной перегородкой. \nТеплообменные трубы и трубные решетки.\nДля стальных теплообменников наиболее широко применяют трубки с наружным диаметром 20, 25, 38, 57 мм. Трубки диаметром 25 мм наиболее распространены в химической промышленности, 20 мм – в нефтеперерабатывающей промышленности. Трубки диаметром 38 и 57 применяют при работе с загрязненными или вязкими жидкостями. Для кожухотрубных теплообменников применяют цельнотянутые трубки из сталей 10, 20, для агрессивных сред трубки из высоколегированных и коррозионностойких сталей, меди, титана, алюминия, графита. Длину труб теплообменника выбирают в зависимости от диаметра кожуха аппарата. При диаметре кожуха 300 – 600 мм длину труб принимают 1 – 6 м, а в аппаратах большого диаметра – до 9м.\nС увеличением длины труб и уменьшением диаметра аппарата его стоимость снижается. Наиболее дешевым является теплообменник с длиной труб 5-7м.\nТрубная решётка – это диск с отверстиями под трубки, имеющий различную толщину, в зависимости от конструкции теплообменника и рабочих параметров. Трубную решетку изготавливают из цельных стальных листов или поковок.\nВ теплообменниках типа ТН и ТК трубная решётка со стороны входа теплоносителя в трубное пространство – приваривается к кожуху, типа ТУ и ТП трубная решётка закрепляется между фланцами, т. е. применяют разъёмное соединение кожуха с трубной решёткой (позволяет изымать трубный пучок с решёткой из кожуха). \nСхема расположения труб в трубной решетке и шаг отверстия регламентируется ГОСТ 31842-2012. В теплообменниках в основном применяют четыре способа размещения труб в пучке: по вершинам равностороннего треугольника, квадратов и по окружности (трубы располагают в кислородной аппараптуре). \nПервые два способа позволяют разместить равномерно наибольшее число труб в пучке. Размещение труб по вершинам квадрата обеспечивает доступность межтрубного пространства для чистки.\nВ теплообменниках  типа ТН и ТК трубы размещают по вершинам равностороннего треугольника, для теплообменников ТП и ТУ – по вершинам квадратов или равносторонних треугольников.\nКрепление труб. Наиболее ответственным узлом теплообменника является соединение труб с трубной решёткой. Это соединение может быть обеспечено развальцовкой, сваркой пайкой и склеиванием. \nНаиболее распространено крепление труб развальцовкой. Развальцовку без канавок применяют при давлении до 0,6 МПа, более – применяют развальцовку с канавками. Обычно делают две канавки, при более высоких давлениях делают больше.\n Более надёжно соединение  - сваркой. \nПриварка труб используется при высоких давлениях или температурах, а также в том случае, когда требуется абсолютная герметичность соединения. Если трубная решетка большой толщины, то при сварке может возникнуть опасность перегара конца трубы (обычная опасность при сварке массивной детали с тонким изделием). В этом случае приходиться растачивать  около отверстия решетки концентрические канавки, глубиной равной толщине стенки трубы, расстояние до перемычки равно толщине трубы. Таким образом, в месте сварки свариваемые изделия имеют одинаковую толщину. \nПайка и заливка концов труб мягким припоем используют в медной аппаратуре. \nТрубы из полимерных материала и графита – с помощью клейки. \nКрепление труб сваркой и развальцовкой применяют без ограничений давления и температуры теплоносителей; при этом сначала выполняют сварку, а затем  развальцовку труб.\nПерегородки. Поперечные перегородки устанавливают в межтрубном пространстве, они имеют двойное назначение: они служат для обеспечения соответствующего потока среды и одновременно обеспечивают жесткость трубного пучка, т.е. поддерживают расстояние между трубами (опорные и ходовые). Толщина перегородки 5мм и более. \nСуществует несколько форм поперечных перегородок: сплошные, с секторным вырезом, с щелевым вырезом, с сегментным вырезом, с кольцевым вырезом.\nНаибольшее распространение получили  перегородки с секторным и сегментным вырезами, т.к. заставляют жидкость двигаться поперёк труб, что улучшает условия теплообмена. \nПоперечные перегородки фиксируются по отношению одна к другой посредством распорных труб, прижимаемых к ним общими тягами (4 –10 тяги), т.е. использование стяжек в трубном пучке обеспечивают жесткость, и дополнительную прочность трубного пучка. Стяжки представляет собой тяги из круглого прутка, пропущенные через отверстия перегородок и трубных решеток, на концах прутка имеется резьба. В промежутках между перегородками на стяжки надеты обрезки труб. При навинчивании гаек нам концевые резьбовые части тяг образуется жесткий каркас. Расстояние между перегородками принимают от 0,2 м до 50dн. \nДля создания двух или нескольких потоков в трубном пространстве устанавливают продольные перегородки. Со стороны крышки перегородка приваривается, со стороны трубной решетки – крепление разъёмное \nГерметизация узла соединения  перегородки с трубной решёткой достигается  с помощью прокладки, уложенной в паз трубной решетки.  Толщина продольных перегородок должна быть не менее 6мм.\n"
    
    let questionsList = [
        "Какое расположение трубок в трубной решётке повышает коэффициент теплоотдачи?",
        "Назначение поперечных перегородок?",
        "В каком теплообменнике можно полностью изымать трубный пучок?",
        "Если теплообменник четырёхходовой то, сколько должно быть перегородок в трубном пространстве?",
        "При каком способе крепления труб уменьшается толщина трубной решётки?",
        "Какой кожухотрубный теплообменник применяют при разности температур 1000 °С и давлении в кожухе более  4 МПа?",
        "Как крепиться поперечная перегородка?",
        "Когда применяют оребренные трубы?",
        "При каком расположение трубок в трубной решётке удобно чистить межтрубное пространство?",
        "Как располагают трубки в  теплообменниках с U- образными трубками?",]
    
    let answersList = ["по вершинам равностороннего треугольника",
                       "по вершинам квадрата",
                       "по концентрическим окружностям",
                       
                       "увеличивает число ходов в трубном пространстве",
                       "поддерживает трубки и увеличивает длину хода теплоносителя в межтрубном пространстве",
                       "увеличивает длину хода теплоносителя в трубном пространстве",
                       
                       "теплообменник с неподвижными трубными решетками  и линзовым компенсатором на кожухе",
                       "теплообменник с неподвижными трубными решетками",
                       "теплообменник с плавающей крышкой",
                       
                       "три перегородки",
                       "четыре перегородки",
                       "пять перегородок",
                       
                       "сваркой",
                       "развальцовкой",
                       "пайкой",
                       
                       "теплообменник с неподвижными трубными решетками  и линзовым компенсатором на кожухе",
                       "теплообменник с неподвижными трубными решетками",
                       "теплообменник с плавающей крышкой",
                       
                       "приваривается к кожуху",
                       "с помощью стяжки",
                       "приваривается к трубкам",
                       
                       "коэффициент теплоотдачи по обе стороны стенки существенно различается",
                       "труба имеет маленькую толщину",
                       "когда отсутствуют поперечные перегородки",
                       
                       "по вершинам равностороннего треугольника",
                       "по вершинам квадрата",
                       "по концентрическим окружностям",
                       
                       "по вершинам равностороннего треугольника",
                       "по вершинам квадрата",
                       "по концентрическим окружностям"]
    
    let rightAnswers      = [1, 2, 3, 1, 1, 3, 2, 1, 2, 2]
}
